{
    "basics": {
      "name": "PAVEL YAKOVLEV",
      "email": "yvpavel@gmail.com",
      "github": "github.com/paulyakovlev"
    },
    "work": [
      {
        "company": "General Motors",
        "location": "Austin, TX",
        "positions": [
        {
          "title": "Data Engineer, Connected Vehicle Data Engineering",
          "startDate": "2025-01-01",
          "endDate": "Present",
          "highlights": [
            "Developed and configured automated data collection for connected vehicles, enabling real-time monitoring of embedded vehicle systems across production fleets.",
            "Conducted vehicle testing and validation in sandbox environments to ensure data collection accuracy before production deployment.",
            "Implemented ETL data pipelines for vehicle configuration metadata management."
          ]
        },
        {
          "title": "Software Engineer, Big Data Engineering & Infrastructure",
          "startDate": "2021-02-21",
          "endDate": "2024-12-30",
          "highlights": [
            "Contributed to migration from Cloudera to GM's custom Hadoop platform (GMDP), generating $1.2M annual cost savings.",
            "Led migration from Cloudera Data Analytics Studio to Tez UI, eliminating closed-source dependencies and reducing licensing costs.",
            "Architected and implemented Oozie ETL pipeline for Ranger audit logs to Parquet format, enabling PowerBI analytics across production clusters.",
            "Contributed to Apache Ambari by implementing Livy as service in the Bigtop stack, enabling proper integration with Ambari deployment, configuration management, and monitoring. (PR #3790)",
            "Enhanced Docker-based Hadoop development environment with local RPM repos and auto-build + deployment of Ambari, significantly improving setup time for developers."
          ]
        }
      ]
      },
      {
        "company": "Lawrence Livermore National Lab",
        "position": "Software Test Engineering Intern",
        "location": "Livermore, CA",
        "startDate": "2019-06-01",
        "endDate": "2019-09-01",
        "highlights": [
          "Improved automated testing by contbuting to JUnit test suite and providing technical documentation"
        ]
      },
      {
        "company": "remote.it",
        "position": "Software Engineering Intern",
        "location": "Palo Alto, CA",
        "startDate": "2018-05-01",
        "endDate": "2019-06-01",
        "highlights": [
          "Prototyped user-end web portals for device monitoring and management",
          "Wrote a library of user-end Python and Shell scripts to manage IoT edge devices",
          "Provided technical documentation for internal and end-user software tools"
        ]
      }
    ],
    "education": [
      {
        "institution": "University of California, Santa Cruz",
        "area": "Computer Science",
        "studyType": "Bachelor's Degree",
        "graduationYear": "Class of 2020"
      }
    ],
    "skills": [
      {
        "name": "Languages",
        "keywords": ["C++", "Java", "Python", "Javascript", "HTML", "CSS"]
      },
      {
        "name": "Frameworks and Tools",
        "keywords": ["ReactJS", "NodeJS", "Flask", "SQL", "git", "Docker", "REST", "Agile"]
      }
    ]
  }